[DATA_INTEGRATION_CS-olly_default]
action.itsi_event_generator = 1
action.itsi_event_generator.param.drilldown_search_earliest_offset = %itsiDrilldownEarliestOffset%
action.itsi_event_generator.param.drilldown_search_latest_offset = %itsiDrilldownLatestOffset%
action.itsi_event_generator.param.drilldown_search_search = %itsiDrilldownSearch%
action.itsi_event_generator.param.drilldown_search_title = %itsiDrilldownSearchName%
action.itsi_event_generator.param.drilldown_title = %itsiDrilldownWebName%
action.itsi_event_generator.param.drilldown_uri = %itsiDrilldownWebURL%
action.itsi_event_generator.param.event_identifier_fields = groupingid
action.itsi_event_generator.param.itsi_instruction = %itsi_instruction%
action.itsi_event_generator.param.meta_data = {}
action.itsi_event_generator.param.owner = %owner%
action.itsi_event_generator.param.search_type = basic
action.itsi_event_generator.param.severity = %severity_id%
action.itsi_event_generator.param.status = %status%
action.itsi_event_generator.param.title = %title%
action.webhook.enable_allowlist = 0
alert.suppress = 1
alert.suppress.fields = signature,src,subcomponent
alert.suppress.period = 59m
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = Correction Search for data integration connection: olly_default
disabled = 1
dispatch.earliest_time = -24h
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = index=main app=splunk_o11y_cloud earliest=-59m latest=now | eval src = coalesce( 'src', "o11y") | eval signature = coalesce( 'signature', "default_o11y_signature") | eval vendor_severity = coalesce( 'vendor_severity', "OK") | eval severity_id = coalesce( 'severity_id', "1") | eval title = coalesce( 'signature', "default_title") | eval owner = coalesce( "unassigned", "unassigned") | eval status = coalesce( "1", "1") | eval subcomponent = coalesce(subcomponent, "-") | eval description =  'description' | eval app =  'app' | eval itsiDrilldownSearch =  'itsiDrilldownSearch' | eval itsiDrilldownEarliestOffset = coalesce(itsiDrilldownEarliestOffset, "-900", "-900") | eval itsiDrilldownLatestOffset = coalesce(itsiDrilldownLatestOffset, "900", "900") | eval itsiDrilldownWebURL = coalesce(itsiDrilldownWebURL, "https://splunk.com") | eval internal_groupingid = "ALARM:" .  signature . ":" . src . ":" . subcomponent | eval groupingid=coalesce(groupingid, internal_groupingid) \
  | eval event_identifier_string=groupingid \
  | dedup event_identifier_string sortby -_time -severity_id

[DATA_INTEGRATION_CS-appdynamics_default]
action.itsi_event_generator = 1
action.itsi_event_generator.param.drilldown_search_earliest_offset = %itsiDrilldownEarliestOffset%
action.itsi_event_generator.param.drilldown_search_latest_offset = %itsiDrilldownLatestOffset%
action.itsi_event_generator.param.drilldown_search_search = %itsiDrilldownSearch%
action.itsi_event_generator.param.drilldown_search_title = %itsiDrilldownSearchName%
action.itsi_event_generator.param.drilldown_title = %itsiDrilldownWebName%
action.itsi_event_generator.param.drilldown_uri = %itsiDrilldownWebURL%
action.itsi_event_generator.param.event_identifier_fields = groupingid
action.itsi_event_generator.param.itsi_instruction = %itsi_instruction%
action.itsi_event_generator.param.meta_data = {}
action.itsi_event_generator.param.owner = %owner%
action.itsi_event_generator.param.search_type = basic
action.itsi_event_generator.param.severity = %severity_id%
action.itsi_event_generator.param.status = %status%
action.itsi_event_generator.param.title = %title%
action.webhook.enable_allowlist = 0
alert.suppress = 1
alert.suppress.fields = signature,src,subcomponent
alert.suppress.period = 59m
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = Correction Search for data integration connection: appdynamics_default
disabled = 1
dispatch.earliest_time = -24h
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = index=main sourcetype=appdynamics_summary earliest=-59m latest=now | eval src = coalesce( 'src', "appdynamics") | eval signature = coalesce( 'signature', "default_appdynamics_signature") | eval vendor_severity = coalesce( 'vendor_severity', "OK") | eval severity_id = coalesce( 'severity_id', "1") | eval title = coalesce( 'signature', "default_title") | eval owner = coalesce( "unassigned", "unassigned") | eval status = coalesce( "1", "1") | eval subcomponent = coalesce(subcomponent, "-") | eval description =  'description' | eval app =  'app' | eval itsiDrilldownSearch =  'itsiDrilldownSearch' | eval itsiDrilldownEarliestOffset = coalesce(itsiDrilldownEarliestOffset, "-900", "-900") | eval itsiDrilldownLatestOffset = coalesce(itsiDrilldownLatestOffset, "900", "900") | eval itsiDrilldownWebURL = coalesce(itsiDrilldownURI, itsiDrilldownWebURL, "https://splunk.com") | eval internal_groupingid = "ALARM:" .  signature . ":" . src . ":" . subcomponent | eval groupingid=coalesce(groupingid, internal_groupingid) \
  | eval event_identifier_string=groupingid \
  | dedup event_identifier_string sortby -_time -severity_id

[DATA_INTEGRATION_CS-thousandeyes_default]
action.itsi_event_generator = 1
action.itsi_event_generator.param.drilldown_search_earliest_offset = %itsiDrilldownEarliestOffset%
action.itsi_event_generator.param.drilldown_search_latest_offset = %itsiDrilldownLatestOffset%
action.itsi_event_generator.param.drilldown_search_search = %itsiDrilldownSearch%
action.itsi_event_generator.param.drilldown_search_title = %itsiDrilldownSearchName%
action.itsi_event_generator.param.drilldown_title = %itsiDrilldownWebName%
action.itsi_event_generator.param.drilldown_uri = %itsiDrilldownWebURL%
action.itsi_event_generator.param.event_identifier_fields = groupingid
action.itsi_event_generator.param.itsi_instruction = %itsi_instruction%
action.itsi_event_generator.param.meta_data = {}
action.itsi_event_generator.param.owner = %owner%
action.itsi_event_generator.param.search_type = basic
action.itsi_event_generator.param.severity = %severity_id%
action.itsi_event_generator.param.status = %status%
action.itsi_event_generator.param.title = %title%
action.webhook.enable_allowlist = 0
alert.suppress = 1
alert.suppress.fields = signature,src,subcomponent
alert.suppress.period = 59m
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = Correction Search for data integration connection: thousandeyes_default
disabled = 1
dispatch.earliest_time = -24h
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = index=main sourcetype=thousandeyes_summary earliest=-59m latest=now | eval src = coalesce( 'src', "thousandeyes") | eval signature = coalesce( 'signature', "default_thousandeyes_signature") | eval vendor_severity = coalesce( 'vendor_severity', "OK") | eval severity_id = coalesce( 'severity_id', "1") | eval title = coalesce( 'signature', "default_title") | eval owner = coalesce( "unassigned", "unassigned") | eval status = coalesce( "1", "1") | eval subcomponent = coalesce(subcomponent, "-") | eval description =  'description' | eval app =  'app' | eval itsiDrilldownSearch =  'itsiDrilldownSearch' | eval itsiDrilldownEarliestOffset = coalesce(itsiDrilldownEarliestOffset, "-900", "-900") | eval itsiDrilldownLatestOffset = coalesce(itsiDrilldownLatestOffset, "900", "900") | eval itsiDrilldownWebURL = coalesce(itsiDrilldownURI, itsiDrilldownWebURL, "https://splunk.com") | eval internal_groupingid = "ALARM:" .  signature . ":" . src . ":" . subcomponent | eval groupingid=coalesce(groupingid, internal_groupingid) \
  | eval event_identifier_string=groupingid \
  | dedup event_identifier_string sortby -_time -severity_id

[itsi_batch_at_search_kpi_minus7d]
action.summary_index._et = -10080m
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 0 * * *
disabled = False
dispatch.earliest_time = -10080m
dispatch.latest_time = now
enableSched = 1
search = | inputlookup kpi_at_info_lookup | search adaptive_thresholding_training_window=-7d | sort limit=0 service_id | rename _key as kpi_id | fields kpi_id | itsibatchat training_window=-7d

[itsi_batch_at_search_kpi_minus14d]
action.summary_index._et = -20160m
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 30 0 * * *
disabled = False
dispatch.earliest_time = -20160m
dispatch.latest_time = now
enableSched = 1
search = | inputlookup kpi_at_info_lookup | search adaptive_thresholding_training_window=-14d | sort limit=0 service_id | rename _key as kpi_id | fields kpi_id | itsibatchat training_window=-14d

[itsi_batch_at_search_kpi_minus30d]
action.summary_index._et = -43200m
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 1 * * *
disabled = False
dispatch.earliest_time = -43200m
dispatch.latest_time = now
enableSched = 1
search = | inputlookup kpi_at_info_lookup | search adaptive_thresholding_training_window=-30d | sort limit=0 service_id | rename _key as kpi_id | fields kpi_id | itsibatchat training_window=-30d

[itsi_batch_at_search_kpi_minus60d]
action.summary_index._et = -86400m
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 30 1 * * *
disabled = False
dispatch.earliest_time = -86400m
dispatch.latest_time = now
enableSched = 1
search = | inputlookup kpi_at_info_lookup | search adaptive_thresholding_training_window=-60d | sort limit=0 service_id | rename _key as kpi_id | fields kpi_id | itsibatchat training_window=-60d

[ITSI Import Objects - tc2_service_entity_import]
action.itsi_import_objects = 1
action.itsi_import_objects.param.backfill_enabled = 0
action.itsi_import_objects.param.entity_identifier_fields = service_name
action.itsi_import_objects.param.entity_merge_field = child_name
action.itsi_import_objects.param.entity_title_field = child_name
action.itsi_import_objects.param.service_enabled = 1
action.itsi_import_objects.param.service_team = default_itsi_security_group
action.itsi_import_objects.param.service_templates_config = {}
action.itsi_import_objects.param.service_title_field = parent_name
action.itsi_import_objects.param.update_type = upsert
cron_schedule = 15 * * * *
dispatch.earliest_time = -7d
dispatch.latest_time = now
enableSched = 1
search = index=tc2_snow_cmdb source="/home/splunk/Splunk/cmdb_rel_ci.csv"  | rename parent_sys_id as sys_id \
| join sys_id [search index="tc2_snow_cmdb"  source="/home/splunk/Splunk/cmdb_ci.csv" sys_class_name="cmdb_ci_service"]\
| join child_sys_id  [search index="tc2_snow_cmdb"  source="/home/splunk/Splunk/cmdb_ci.csv" | rename sys_id as child_sys_id , sys_class_name as child_sys_class_name | fields child_sys_id,child_sys_class_name ]\
| search sys_class_name="cmdb_ci_service" AND child_sys_class_name!="cmdb_ci_service" | table parent_name,child_name | eval service_name=parent_name

[Indicator - c9910736fdac3d9f748d60e0 - ITSI Search]
action.indicator = 1
action.indicator._itsi_kpi_id = c9910736fdac3d9f748d60e0
action.indicator._itsi_service_id = 282f3f59-45e1-47c3-ab13-81126adc9c37
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 0
cron_schedule = 0-59/5 * * * *
description = Auto created scheduled search during kpi creation
dispatch.earliest_time = -330s
dispatch.latest_time = -30s
enableSched = 1
search = index=_introspection sourcetype=splunk_resource_usage component=PerProcess data.process="splunkd" \
| table _time, data.mem_used \
| eval host="YanSu-PC"\
| rename data.mem_used as mem_usage | `aggregate_raw_into_entity(avg, mem_usage, "host")` | eval sec_grp = "default_itsi_security_group" | `match_entities(host, sec_grp)` | eval serviceid = "282f3f59-45e1-47c3-ab13-81126adc9c37" | `aggregate_entity_into_service(avg)` | `assess_severity(282f3f59-45e1-47c3-ab13-81126adc9c37, c9910736fdac3d9f748d60e0, true, true, true)` | eval kpi="ArGo SMTP Server Memory", urgency="5", alert_period="5", serviceid="282f3f59-45e1-47c3-ab13-81126adc9c37" | `assess_urgency` | `gettime`

[Indicator - 81b9a54a53cce8d3895649b0 - ITSI Search]
action.indicator = 1
action.indicator._itsi_kpi_id = 81b9a54a53cce8d3895649b0
action.indicator._itsi_service_id = 282f3f59-45e1-47c3-ab13-81126adc9c37
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 0
cron_schedule = 3-59/5 * * * *
description = Auto created scheduled search during kpi creation
dispatch.earliest_time = -330s
dispatch.latest_time = -30s
enableSched = 1
search = index=_introspection sourcetype=splunk_resource_usage component=IOStats \
| eval mount_point = 'data.mount_point'\
| eval reads_ps = 'data.reads_ps'\
| eval writes_ps = 'data.writes_ps'\
| eval interval = 'data.interval'\
| eval op_count = (reads_ps + writes_ps) * interval\
| eval avg_service_ms = 'data.avg_service_ms'\
| eval avg_wait_ms = 'data.avg_total_ms' | `aggregate_raw_into_service(avg, avg_service_ms)` | `assess_severity(282f3f59-45e1-47c3-ab13-81126adc9c37, 81b9a54a53cce8d3895649b0, true, true, true)` | eval kpi="ArGo SMTP Server IO service_time", urgency="5", alert_period="5", serviceid="282f3f59-45e1-47c3-ab13-81126adc9c37" | `assess_urgency` | `gettime`

[Splunk App for Infrastructure Alerts]
action.webhook.enable_allowlist = 0
disabled = 1

[tc2 event on service ArGo SMTP Server on instance YanSu-PC]
action.email.includeEntities = 0
action.itsi_event_generator = 1
action.itsi_event_generator.param.entity_lookup_field = host
action.itsi_event_generator.param.event_identifier_fields = %host%,%service%
action.itsi_event_generator.param.itsi_instruction = %itsi_instruction%
action.itsi_event_generator.param.meta_data = {}
action.itsi_event_generator.param.search_type = basic
action.itsi_event_generator.param.service_ids = 282f3f59-45e1-47c3-ab13-81126adc9c37
action.itsi_event_generator.param.severity = 5
action.itsi_event_generator.param.title = tc2 event on service ArGo SMTP Server on instance YanSu-PC
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */1 * * * *
dispatch.earliest_time = -15m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = | makeresults \
| eval host="YanSu-PC" | eval service="ArGo SMTP Server" | `filter_maintenance_services("282f3f59-45e1-47c3-ab13-81126adc9c37")` | `apply_entity_lookup(host)`

[tc2 event on service ArGo SMTP Server]
action.email.includeEntities = 0
action.itsi_event_generator = 1
action.itsi_event_generator.param.event_identifier_fields = %service%
action.itsi_event_generator.param.itsi_instruction = %itsi_instruction%
action.itsi_event_generator.param.meta_data = {}
action.itsi_event_generator.param.search_type = basic
action.itsi_event_generator.param.service_ids = 282f3f59-45e1-47c3-ab13-81126adc9c37
action.itsi_event_generator.param.severity = 5
action.itsi_event_generator.param.title = tc2 event on service ArGo SMTP Server
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */1 * * * *
dispatch.earliest_time = -15m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = | makeresults \
| eval service="ArGo SMTP Server" | `filter_maintenance_services("282f3f59-45e1-47c3-ab13-81126adc9c37")`

[tc2 event on service Splunk]
action.email.includeEntities = 0
action.itsi_event_generator = 1
action.itsi_event_generator.param.entity_lookup_field = host
action.itsi_event_generator.param.event_identifier_fields = %service%
action.itsi_event_generator.param.itsi_instruction = %itsi_instruction%
action.itsi_event_generator.param.meta_data = {}
action.itsi_event_generator.param.search_type = basic
action.itsi_event_generator.param.service_ids = 85b0badf-c84d-4b34-8611-ec4c5014c895
action.itsi_event_generator.param.severity = 5
action.itsi_event_generator.param.title = tc2 event on service Splunk
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */1 * * * *
dispatch.earliest_time = -15m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = | makeresults \
| eval service="Splunk" | `filter_maintenance_services("85b0badf-c84d-4b34-8611-ec4c5014c895")` | `apply_entity_lookup(host)`

[tc2 event on service Splunk on instance localhost.localdomain]
action.email.includeEntities = 0
action.itsi_event_generator = 1
action.itsi_event_generator.param.entity_lookup_field = host
action.itsi_event_generator.param.event_identifier_fields = %host%,%service%
action.itsi_event_generator.param.itsi_instruction = %itsi_instruction%
action.itsi_event_generator.param.meta_data = {}
action.itsi_event_generator.param.search_type = basic
action.itsi_event_generator.param.service_ids = 85b0badf-c84d-4b34-8611-ec4c5014c895
action.itsi_event_generator.param.severity = 5
action.itsi_event_generator.param.title = tc2 event on service Splunk on instance localhost.localdomain
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */1 * * * *
dispatch.earliest_time = -15m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = | makeresults \
| eval host="localhost.localdomain" | eval service="Splunk" | `filter_maintenance_services("85b0badf-c84d-4b34-8611-ec4c5014c895")` | `apply_entity_lookup(host)`

[Bidirectional Ticketing]
action.webhook.enable_allowlist = 0

[High Scale EA Backfill]
action.webhook.enable_allowlist = 0
alert.track = 0
